import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        // Ввод сторон квадратов
        System.out.println("Введите длины сторон четырех квадратов:");
        int A = scanner.nextInt();
        int B = scanner.nextInt();
        int C = scanner.nextInt();
        int D = scanner.nextInt();

        // Инициализируем переменную для подсчета прямоугольников
        int rectangles = 0;

        // Проверка всех возможных комбинаций
        if (A == B && B == C && C == D) { // все квадраты одинаковы, тогда из них можно сложить только 3 прямоугольника
            rectangles = 3;
        } else if ((A == B && A == C) || (A == C && C == D) || (A == B && B == D) || (B == C && D == B)) { // стороны 3х квадратов равны
            rectangles = 2;
            if (((A == B && A == C) && (A * 3 == D || A * 2 == D || A == D)) ||
                    ((A == C && C == D) && (A * 3 == B || A * 2 == B || A == B)) ||
                    ((A == B && B == D) && (A * 3 == C || A * 2 == C || A == C)) ||
                    ((B == C && D == B) && (B * 3 == A || 2 * B == A || B == A))) {//сумма 3 сторон квадратов равна четвертому
                //сумма сторон 2х квадратов из 3 одинаковых равна стороне 4ому квадрату
                //сторона одного из 3 одинаковых квадратов равна стороне 4ого квадрату
                rectangles += 1;
            }
        }else if (A == B || A == C || A == D || B == C || B == D || C == D) { // стороны 2х квадратов равны
            rectangles = 1;
            if ((A == B && C == D) || (A == C && B == D) || (A == D && B == C)) { // стороны 4х квадратов попарно равны
                rectangles += 1;
                if (((A == B && C == D && (A * 2 == C || C * 2 == A)) ||
                        ((A == C && B == D) && (A * 2 == B || B * 2 == A)) ||
                        ((A == D && B == C) && (A * 2 == B || B * 2 == A)))) {
                        // сумма сторон 2х равных квадратов равна стороне третьего(третий равен четвертому)
                        rectangles += 2;
                    }
            } else if ((A == B && (A * 2 == C || A * 2 == D)
                    || A == C && (A * 2 == B || A * 2 == D)
                    || A == D && (A * 2 == B || A * 2 == C)
                    || B == C && (B * 2 == A || B * 2 == D)
                    || B == D && (B * 2 == A || B * 2 == C)
                    || C == D && (C * 2 == A || C * 2 == B))) {
                    //сумма сторон 2х равных квадратов равна стороне третьего/четвертого
                    rectangles += 1;
                }
            }
        System.out.println("Можно сложить прямоугольников: " + rectangles); // Вывод результата
    }
}
